Revit 2025 API
CapitalizationForLoadNames Enumeration
 Enumerated type listing the options for how electrical load names should be capitalized.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum CapitalizationForLoadNames
Public Enumeration CapitalizationForLoadNames
public enum class CapitalizationForLoadNames
type CapitalizationForLoadNames
Members
Member name | Value | Description
SourceParameters | 0 |  Use the capitalization formatting taken from the parameters that create the load name (Revit 2011 and previous).
Initial | 1 |  Capitalize the first letter of each word in the load name.
Sentence | 2 |  Capitalize only the first letter of the first word in the load name.
Upper | 3 |  Capitalize all letters of every word in the load name.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace